configuration/20201107143115-move_line.org
:PROPERTIES:
:ID:       3376EBCD-DCDB-4D53-86C1-5077FC571797
:END:
#+title: move line

[[id:C82F0D56-70CE-46B6-B211-30B2DFE5CC08][editing]] [[id:B87BE6C5-BF53-4B06-9713-1C272540530B][UI]]

https://www.emacswiki.org/emacs/MoveLine

#+BEGIN_SRC emacs-lisp :results silent
(defun move-line (n)
  "Move the current line up or down by N lines."
  (interactive "p")
  (setq col (current-column))
  (beginning-of-line) (setq start (point))
  (end-of-line) (forward-char) (setq end (point))
  (let ((line-text (delete-and-extract-region start end)))
    (forward-line n)
    (insert line-text)
    ;; restore point to original column in moved line
    (forward-line -1)
    (forward-char col)))

(defun move-line-up (n)
  "Move the current line up by N lines."
  (interactive "p")
  (move-line (if (null n) -1 (- n))))

(defun move-line-down (n)
  "Move the current line down by N lines."
  (interactive "p")
  (move-line (if (null n) 1 n)))

(global-set-key (kbd "M-<up>") 'move-line-up)
(global-set-key (kbd "M-<down>") 'move-line-down)
#+END_SRC
